app/controllers/review_controller.rb

INSERT INTO `reviews` (`created_at`, `nickname`, `product_id`, `rate`, `review`, `updated_at`) VALUES ('2015-03-08 08:28:01', '岸上', 1, 1, '面白かった', '2015-03-08 08:28:01')
---
  def create
    Review.create(nickname: create_params[:nickname], rate: create_params[:rate], review: create_params[:review], product_id: create_params[:id])