app/controllers/top_controller.rb

  def index
    @products = Product.order("id ASC").limit(20)
---
SELECT `products`.* FROM `products` ORDER BY id DESC LIMIT 20

  def entry
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 0 LIMIT 1

  def search
    @search_results = Product.where('title LIKE(?)', "%#{params[:keyword]}%")
---
SELECT `products`.* FROM `products` WHERE (title LIKE('%params[:keyword]%'))