app/controllers/users_controller.rb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 2 ORDER BY created_at DESC
---
  def show
    @my_reviews = Review.where(user_id: current_user.id).order('created_at DESC')